### Terraform Plan `a2ddf8d55f0bbfe2fa41b1d700596a367801af29`
  <details>
  <summary>Show Plan</summary>
  
  ```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc_flow_logs.aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/main-flow-logs"
      + name_prefix       = (known after apply)
      + region            = "eu-west-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/vpc/main-flow-logs"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "/aws/vpc/main-flow-logs"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
    }

  # module.vpc_flow_logs.aws_flow_log.vpc will be created
  + resource "aws_flow_log" "vpc" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + max_aggregation_interval = 600
      + region                   = "eu-west-1"
      + tags                     = {
          + "Name" = "main-vpc-flow-log"
        }
      + tags_all                 = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-vpc-flow-log"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0be291367ed1bb530"
    }

  # module.vpc_flow_logs.aws_iam_role.vpc_flow_logs will be created
  + resource "aws_iam_role" "vpc_flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "main-vpc-flow-logs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "main-vpc-flow-logs-role"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-vpc-flow-logs-role"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpc_flow_logs.aws_iam_role_policy.vpc_flow_logs will be created
  + resource "aws_iam_role_policy" "vpc_flow_logs" {
      + id          = (known after apply)
      + name        = "main-vpc-flow-logs-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
  </details>
  
  *Binary plan file available as workflow artifact*